# Решение через dict

#year_time_dict = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето", 7: "Лето", 8: "Лето", 9: "Осень", 10: "Осень", 11: "Осень", 12: "Зима"}
#year_month_dict = {1: "Январь", 2: "Февраль", 3: "Март", 4: "Апрель", 5: "Май", 6: "Июнь", 7: "Июль", 8: "Август", 9: "Сентябрь", 10: "Октябрь", 11: "Ноябрь", 12: "Декабрь"}
#user_month_num = int(input("Введите номер месяца от 1 до 12: "))
#print(f"Это - {year_time_dict[user_month_num]}")
#print(f"Месяц - {year_month_dict[user_month_num]}")



# Решение через list

#year_time_list = ["Зима", "Зима", "Весна", "Весна", "Весна", "Лето", "Лето", "Лето", "Осень", "Осень", "Осень", "Зима"]
#year_month_list = ["Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"]
#user_month_num = int(input("Введите номер месяца от 1 до 12: "))
#print(f"Это - {year_time_list[user_month_num - 1]}")
#print(f"Месяц - {year_month_list[user_month_num - 1]}")



# Решение через dict и list

#year_time_dict = {1: "Зима", 2: "Зима", 3: "Весна", 4: "Весна", 5: "Весна", 6: "Лето", 7: "Лето", 8: "Лето", 9: "Осень", 10: "Осень", 11: "Осень", 12: "Зима"}
#year_month_list = ["Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"]
#user_month_num = int(input("Введите номер месяца от 1 до 12: "))
#print(f"Это - {year_time_dict[user_month_num]}")
#print(f"Месяц - {year_month_list[user_month_num - 1]}")
